<%@ page language="java" contentType="text/html; charset=EUC-KR" pageEncoding="EUC-KR"%>
<html>
<body>
	<h2>jsp구동원리? / 페이지가 작동하는 원리</h2>
	<hr/>
	<h3>서블릿?</h3>
	선 사에서 자바를 이용해서 웹 어플리케이션을 만들수 있는 처음에 내놓았던 기술은 서블릿 이다.<br/>
	서블릿(servlet)은 웹요청 발생시 작동하는 클래스를 서블릿이라고 부른다.<br/>
	
	쓰는 방법 자체가 꽤 많이 복잡하다. 자바를 전혀 모르는 사람이 봤을때 소스 자체를 이해할수가 없고,<br/>
	진입장벽 자체가 꽤 높은 편이다. 자바에서 제공되는 모든 클래스를 다 활용할수 있다는 장점이 있었음에도 불구하고<br/>
	개발자들로부터 크게 반응을 얻지 못했다. 
	
	<br/>
	그래서 쉽게 웹을 만들기 위해서 내놓았던 추가적인 기술이 jsp , 서블릿은 jsp의 모태격인 기술
	<br/>
	서블릿과 jsp의 관계를 살펴보아야 내장객체 등 jsp의 작동원리를 이해할 수 있다.
	<br/>
	만들어봅시다..
	
</body>
</html>